In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model
from word2number import w2n

In [9]:
# load data
df = pd.read_csv("./data/hiring.csv")

# data preprocessing 
df.test.fillna(df.test.mean(),inplace=True)
df['experience'].fillna('zero',inplace = True)
df['experience'] = df['experience'].apply(w2n.word_to_num)

X = df.drop(['salary'],axis=1)
Y = df.salary

# model call
model = linear_model.LinearRegression()
model.fit(X,Y)


# predict value 
model.predict([[5,6,7]])

# model.score(X,Y)

/home/user/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

0.9639958361860578

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5